[
{
  "model": "scraping.city",
  "pk": 1,
  "fields": {
    "name": "Москва",
    "slug": "moskva"
  }
},
{
  "model": "scraping.city",
  "pk": 2,
  "fields": {
    "name": "Санкт-Петербург",
    "slug": "sankt-peterburg"
  }
},
{
  "model": "scraping.city",
  "pk": 3,
  "fields": {
    "name": "Орск",
    "slug": "orsk"
  }
},
{
  "model": "scraping.language",
  "pk": 1,
  "fields": {
    "name": "Python",
    "slug": "python"
  }
},
{
  "model": "scraping.language",
  "pk": 2,
  "fields": {
    "name": "Java",
    "slug": "java"
  }
},
{
  "model": "scraping.language",
  "pk": 3,
  "fields": {
    "name": "Go",
    "slug": "go"
  }
},
{
  "model": "scraping.vacancy",
  "pk": 1,
  "fields": {
    "title": "Разработчик Python",
    "company": "GRAFFIT",
    "url": "https://bryansk.hh.ru/vacancy/42564873",
    "description": "Требуемый опыт работы: 1–3 года\r\n\r\nПолная занятость, удаленная работа\r\n\r\nВозможно временное оформление: договор услуг, подряда, ГПХ, самозанятые, ИП\r\n\r\nGRAFFIT – это selfedtech стартап. Наш продукт, поможет людям осознано, удобно и быстро изучать литературу для саморазвития.\r\nВ реализации задуманного, используем AI технологии, дизайн мышление, эвристические методики ТРИЗ и собственные наработки. Достигать поставленных целей помогают наши ценности:\r\n\r\nОшибка - нормально, потому что делает нас сильнее и умнее.\r\nДоверие - элемент успеха компании, для этого реализуем принципы честности, разумности, самостоятельности и свободы воплощения собственных идей в работе.\r\nРабота - место для личностного роста человека. Каждый кто попал в нашу команду может комфортно развиваться, в важных для него сферах жизни.\r\nДля разработки серверной части мобильного приложения, а также ряда других проектов ищем в команду разработчика Python. Нам важны следующие качества будущего коллеги:\r\n\r\n    При возникновении задачи, которую не понятно как решать (таких будет много), вы пытаетесь найти решения поставленной задачи - копаетесь на github, перечитываете посты stackoverflow, изучаете документацию, а не просто говорите «я не смог».\r\n    Если вы знаете решение задачи или нашли его (см. 1 пункт), вы включаете критическое мышление (на самом деле мы надеемся, что вы его никогда не выключаете) и думаете, подходит ли оно вам в данных условиях, можно ли его улучшить, можно ли сделать код более красивым.\r\n    Вы не боитесь задавать вопросы, даже, как вам кажется, самые глупые. Если вам что-то не понятно в задачи, вы спрашиваете, переспрашиваете, а потом ещё раз переспрашиваете, пока задача не станет вам полностью ясна.\r\n    Вы считаете, что неделя прошла бесполезна, если не узнали чего-то нового, так как считаете самообучение неотъемлемой частью специальности разработчика, стоящим в одном ряду с написанием кода, тестированием и т.д.\r\n    Вы способны и не боитесь признавать свои ошибки. Вовремя найденная и формализованная ошибка может превратиться в «фичу» :)\r\n    Вы по хорошему любопытны — логичное продолжение пунктов 1 и 2. Вам интересно находить и изучать новые алгоритмы, методы, инструменты. В поисках решения текущей задачи, Вы можете «залипнуть» на случайно найденном подходе/алгоритме/методологии, потому что это показалось вам очень интересным/полезным/красивым.\r\n    Вы достаточно самостоятельны и организованы, что бы самому разделить задачу на подзадачи, поставить их в Jira, а затем занести результаты в Confluence.\r\n\r\nБлизки наши ценности, любите писать красивый код, хотите создать полезное приложение, присылайте информацию о себе. Если компетенции будут отвечать требованиям, пришлем домашнее задание. Домашняя работа успешно выполнена, приглашаем на встречу.\r\n\r\nЧем предстоит заниматься:\r\n\r\n    Участвовать в разработке архитектуры серверной части продуктов.\r\n    Писать и запускать тесты.\r\n    Реализовывать принятую архитектуру.\r\n    Участвовать в проектировании схем баз данных.\r\n    Проводить рефакторинг собственного кода.\r\n    Изучать документацию сторонних сервисов для интеграции с реализуемыми проектами.\r\n    Оптимизировать алгоритмы.\r\n    Изучать новые подходы/алгоритмы/инструменты.\r\n    Взаимодействовать с продуктологом, UX/UI дизайнером, разработчиком мобильных приложений.\r\n    Проводить декомпозицию и оценивать сроки выполнения задач.\r\n    Документировать результаты работы.\r\n    Находить решение нетривиальных задач.\r\n\r\nЧто делать НЕ придётся:\r\n\r\n    Заниматься UX/UI дизайном.\r\n    Реализовывать Frontend.\r\n    Разрабатывать функциональные требования (идеи по новым «фичам», конечно, приветствуется).\r\n\r\nМы ждем, что у вас есть:\r\n\r\n    Высшее техническое образование.\r\n    Знание алгоритмов и структур данных.\r\n    Опыт разработки на Python от 1 года или готовые проекты на Github.\r\n    Опыт работы с REST API и HTTP. Выполнение запросов и их разбор.\r\n    Опыт работы хотя бы с одной реляционной СУБД в Python.\r\n    Опыт написание модульных тестов.\r\n\r\nМы предлагаем:\r\n\r\n    Полностью официальную зарплату.\r\n\r\n    Удаленную работу.\r\n\r\n    Удобный график.\r\n\r\n    Участие в запуске и развитие глобального продукта.\r\n\r\n    Бонус по достижению бизнес результата.\r\n\r\nКлючевые навыки\r\nPython",
    "city": 1,
    "language": 1,
    "timestamp": "2021-03-11"
  }
},
{
  "model": "scraping.vacancy",
  "pk": 2,
  "fields": {
    "title": "Go Golang Developer",
    "company": "amoCRM",
    "url": "https://bryansk.hh.ru/vacancy/42933699",
    "description": "amoCRM - стабильная и динамично развивающаяся IT-компания, более 7 лет на международном рынке, один из лидеров в области разработки системы учета клиентов. Мы разрабатываем облачную CRM-систему для автоматизации работы отделов продаж и помогаем нашим клиентам вести их бизнес.\r\n\r\nСервисом пользуется более 30 тыс. компаний в различных странах мира: Россия, СНГ, США, Европа, Австралия, Канада и пр. В числе наших клиентов такие бренды как: Mail.Ru Group, Яндекс, Re:Store, Деловой мир, Аргументы и Факты, Radio Records, Love Radio, БКС и другие.\r\n\r\nКого мы ищем:\r\n\r\n    В команду проекта amoCRM (в московский офис) ищем Junior Golang разработчика;\r\n    Трудолюбивого и ответственного человека, желающего развиваться в области программирования;\r\n    Ожидаем, что у вас уже есть какой-то опыт, он может быть не коммерческим, но у вас есть результаты и логически завершенные проекты, которые покажут, что вы увлеченно, пусть даже дома для себя, развиваетесь и пишите приложения на Golang;\r\n\r\nДля чего ищем:\r\n\r\n    Работа над корпоративным мессенджером. Функционал позволяет общаться пользователям системы между собой (директ чаты), создавать рабочие группы (групповые чаты). Обмениваться изображениями, файлами.\r\n\r\n    Мессенджер интегрирован с соц. сетями: facebook, vk, telegram, instagram, viber. Пользователь может подключить одну или несколько своих страниц в соц сетях и общаться с клиентами прямо из интерфейса amoCRM.\r\n\r\nЗадача:\r\n\r\n    Доработка backend приложения на Golang по техническому заданию, запуск в production;\r\n    Поддержка и внедрение новых функций;",
    "city": 1,
    "language": 3,
    "timestamp": "2021-03-11"
  }
},
{
  "model": "scraping.vacancy",
  "pk": 3,
  "fields": {
    "title": "Руководитель отдела разработки",
    "company": "ТОО Alpha-Safety",
    "url": "https://bryansk.hh.ru/vacancy/42542486",
    "description": "Привет! Меня зовут Андрей. Я - руководитель компании alphaSMART. Если ты понимаешь, что Product Owner`у нужна вся User Story целиком, а не отдельный ворох решенных back-end и front-end задач, можешь научить новому фреймворку даже падавана и научить других падаванов как учить друг друга, четко и метко планируешь, знаешь много текущих и еще не изобретенных фреймворков, можешь управлять очень разносторонними специалистами, владеешь эмоциональным интеллектом (т.к. программисты - те еще ребята), кайфуешь когда клиенты радуются всем фичам нового релиза и отсутствию багов, имеешь в своем ДНК такие составляющие как тайм-менджмент, возможность гибкого пересчета в уме из попугаев в story points, сможешь четко доказать Леди Гага, что ее Poker face не идет ни в какое сравнение с Poker planning, готов предложить 1000 и 1 способ усовершенствования процессов, готов стать надежным соратником мне и Product Owner`у– тебе к нам! Мы будем рады видеть в своей команде ответственного и креативного руководителя, который сможет разделить наши высокие цели, подготовить весь отдел к предстоящему масштабированию и включению в несколько продуктовых команд. Мне очень нужен надежный партнер, грамотный руководитель. Если ты имеешь опыт, хочешь получать достойное вознаграждение за достижение целей и готов к росту и развитию, тогда ты тот, кто нам нужен. В связи со стремительным ростом и развитием, Группа компаний Alpha-Safety в целом и дочерняя софтверная компания alphaSMART в частности, приглашают в свою Команду руководителя отдела разработки для того, чтобы создать наикрутейшую систему для горно-добывающей промышленности с использованием самых передовых технологий! Группа компаний Alpha-Safety и ее дочерние компании имеют несколько городов присутствия: Алматы, Нур-Султан, Усть-Каменогорск, Новосибирск, Москва, Санкт-Петербург, Орск и другие.\r\n\r\nОбязанности:\r\n\r\n    Работа по выставленным от руководства целями, участие в формировании стратегии развития имеющихся продуктов и инфраструктуры в части разработки;\r\n    Организация эффективной работы отдела разработки, взаимодействия с отделами тестирования, дизайном, аналитиками и консультантами;\r\n    Планирование и проведение совместно с руководством процессов найма сотрудников, проработка системы onboarding и повышения квалификации (в том числе с учетом менторства и наставничества);\r\n    Оттачивание внутренних процессов;\r\n    Координация работы отдела;\r\n    Управление ресурсами отдела;\r\n    Разработка нормативной документации процессов - минимального, но необходимого ее количества;\r\n    Формирование планов и сроков реализации;\r\n    Управление и контроль над проблемами, инцидентами и изменениями;\r\n    Планирование деятельности отдела, контроль сроков, качества выходящего продукта перед тестированием, расходов, отчетность;\r\n    Поддержание атмосферы фокуса команды разработчиков на целях спринта и на выбранной архитектуре;\r\n    Проведение декомпозиции задач бизнеса (user story от Product owner`а) на задачи для разработчиков и передача опыта своим Senior`ам;\r\n    Проработка архитектуры решений;\r\n    Мотивирование членов команды и участие в их развитии (менторство);\r\n    Формирование и обоснование оценок трудозатрат;\r\n    Получение удовольствия от качественной разработки сложного проекта;\r\n    Оценка и постоянное стремление к совершенствованию velocity, сроков и трудоёмкости разработки;\r\n    Определение и внедрение стандартов разработки в соответствии с современными методологиями кодирования и передовыми практиками;\r\n    Создание культуры гибкой разработки;\r\n    Настройка рабочего процесса команды разработчиков;\r\n    Проведение проверки кода, далее делегирование этой задачи Senior`ам;\r\n    Совершенствование процессов четкой постановки задач и контроля выполнения командой разработчиков.\r\n\r\nТребования:\r\n\r\n    Умение переводить бизнес-цели, озвученные руководством, в том числе Product Owner`ом на язык разработчиков;\r\n    Умение работать с несколькими стейкхолдерами и способность расставлять приоритеты, опираясь на задачи бизнеса;\r\n    Управленческие навыки и умение выстраивать работу в команде, воодушевлять, обучать, мотивировать и давать конструктивную обратную связь;\r\n    Опыт выстраивания процессов разработки вплоть до их отражения в Jira;\r\n    Навыки и опыт построения архитектуры ПО, умение ее выстраивать, а также планирование и проектирование межсервисного взаимодействия и архитектуры;\r\n    Гибкость мышления, умение оперативно приспосабливаться к изменениям;\r\n    Опыт тимлида от 1 года;\r\n    Опыт работы с командами по agile фреймфоркам (Scrum/Kanban);\r\n    Экспертиза в Java (Springboot) / JavaScript / от 3-х лет;\r\n    Широкий технический кругозор;\r\n    Умение находить компромиссы при отстаивании своей позиции;\r\n    Желательно наличие опыта работы с базами данных (PostgreSQL, ClickHouse);\r\n    Желательно опыт работы с контейнерами Docker;\r\n    Креативность и широкий кругозор, способность придумать и подготовить несколько вариантов решения;\r\n    Умение и желание работать в команде, а не над индивидуальными задачами;\r\n    Способность переключаться между разными задачами, готовность работать как над стратегическими задачами с руководством, так и параллельно над несколькими модулями и с несколькими командами;\r\n    Эмпатия, готовность ставить себя на место наших любимых клиентов для понимания их нужд;\r\n    Стремление к саморазвитию;\r\n    Знание языков: Английский (желательно Intermediate);\r\n    Наличие в портфолио успешно реализованных и действующих проектов;\r\n    Навыки управления командой разработчиков, включая навыки планирования и детализации задач для команды разработчиков, постановки задач, контроля качества кода;\r\n    Умение оценивать трудоемкость задач и соблюдать дедлайны;\r\n    Чувство ответственности за качественное выполнение поставленных задач;\r\n    Желание создавать шедевры.\r\n\r\nЛичные качества:\r\n\r\n    Нацеленность на результат;\r\n    Использование любых средств для достижения целей и отсутствие tunnel vision;\r\n    Лидерство;\r\n    Исполнительность;\r\n    Коммуникабельность;\r\n    Гибкость в перестраивании планов;\r\n    Инициативность;\r\n    Стрессоустойчивость;\r\n    Планирование и контроль;\r\n    Ответственность и готовность принимать качественные решения.\r\n\r\nЧто мы предлагаем и почему с нами классно работать: Работу над лидирующими на рынке продуктами в команде профессионалов;\r\n\r\n    У нас есть идейные вдохновители, «зажигающие» лидеры с неудержимой энергетикой, который вовлечены в процессы и заряжают весь коллектив на подвиги;\r\n    Высокую зарплату (расширенная система премий);\r\n    Повышение профессионального уровня - внутреннее обучение;\r\n    Бенефиты - внутренние курсы английского языка со скидкой за счет работодателя;\r\n    Комфортные условия работы и отдыха - возможна работа из любой точки мира с периодическими командировками в основные офисы группы компаний;\r\n    Самореализацию и профессиональный рост. Если у вас есть профессиональная мечта - расскажите о ней, возможно мы поможем вам ее реализовать.",
    "city": 3,
    "language": 2,
    "timestamp": "2021-03-11"
  }
}
]
